# Задание: вывести на экран числа от 50 до 100.
#
# 50.upto(100) do |i|
#   puts "#{i}"
# end

# Задание: вывести на экран числа от 50 до 100, и если число четное - рядом с ним написать `true`, если нечетное - `false`.
#
# 50.upto(100) do |i|
#   if i.even?
#     puts "#{i} - true"
#   else
#     puts "#{i} - false"
#   end
# end

# Задание: вы создаете веб-сайт для барбер-шопа. Выведите на экран все виды текстурного крема для волос.
# Каждый вид крема имеет два параметра, SHINE (блеск) и HOLD (стойкость).
# Каждый параметр представлен цифрой от 1 до 5.
#
# 1.upto(5) do |i|
#   1.upto(5) do |j|
#     puts "Текстурный крем : SHINE - #{i}; HOLD - #{j}"
#   end
# end
